// ------------------------------------------------
// ゲームデータを渡すためのクラス
// 主にシーン間でのデータの受け渡しに使用する
// ------------------------------------------------

#include "pch.h"
#include "GameData.h"

std::unique_ptr<GameData> GameData::s_data = nullptr;

// ------------------------------------------------
// インスタンスを返す関数
// ------------------------------------------------
GameData* const GameData::GetInstance()
{
	// インスタンスが生成されていない場合
	if (s_data == nullptr)
	{
		// 生成する
		s_data.reset(new GameData());
	}
	// インスタンスを返す
	return s_data.get();
}


// ------------------------------------------------
// コンストラクタ
// ------------------------------------------------
GameData::GameData()
	: m_battleResult{ BATTLE_RESULT::NONE }
{
}


//---------------------------------------------------------
// 初期化する
//---------------------------------------------------------
void GameData::Initialize()
{
}
