// ------------------------------------------------
// 名前:	HPSystem.h
// 内容:	HPシステムのクラス
//			HPを持つすべてのオブジェクトが所有する
// 作成;	池田桜輔
// ------------------------------------------------
#ifndef HP_SYSTEM
#define HP_SYSTEM
#pragma once
// インクルード
#include "pch.h"

/// <summary>
/// HPシステムクラス
/// </summary>
class HPSystem
{
// ------------------------------------------------
// アクセサ
// ------------------------------------------------
public:
	// 最大HP
	float GetMaxHP() const { return m_maxHP; }
	// 現在のHP
	float GetHP() const { return m_hp; }
	// HPを設定
	void SetHP(float hp) { m_hp = hp; }

// ------------------------------------------------
// メンバ関数(公開)
// ------------------------------------------------
public:
	// コンストラクタ
	HPSystem(float max);
	// デストラクタ
	~HPSystem();
	// 回復
	void Heal(float hp);
	// ダメージ
	bool Damage(float hp);

// ------------------------------------------------
// メンバ関数(非公開)
// ------------------------------------------------
private:
	// 死亡判定
	bool CheckDie();


// ------------------------------------------------
// メンバ変数
// ------------------------------------------------
private:
	// 最大HP
	float m_maxHP;
	// 現在のHP
	float m_hp;
};
#endif